// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
const array = [];
let i = 20;
while (i <= 30) {
  array.push(i);
  i += 0.5;
}
console.log(array);

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const oneDoollar = 27;
for (let i = 10; i <= 100; i += 10) {
  let finalValue = i * oneDoollar;
  console.log(`${i} $ = ${finalValue} HRN`);
}

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
const enteredNumber = +prompt(`Введите число`);
if (!enteredNumber) alert(`Вводите только числа!`);
for (let i = 1; i ** 2 < enteredNumber && i <= 100; i++) {
  console.log(i);
}

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

const enteredNum = +prompt(`Введіть число для первірки`);
let sum = 0;
for (let i = 2; i < enteredNum; i++) {
  if (enteredNum % i == 0) {
    sum += 1;
  }
}
if (sum) console.log(`не просте число`);
else console.log(`це число є простим`);

//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
//(Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

const num = +prompt(`ВВедите число`);
let j = 0;
while (3 ** j < num) {
  j++;
}
if (3 ** j === num)
  console.log(`можна одержати шляхом зведення 3 у ступінь ${j}`);
else console.log(`не можна одержати шляхом зведення 3 у ступінь`);
